app/controllers/associations_controller.rb

  def index
    @associations = Association.all
---
SELECT "associations".* FROM "associations"

  def show
    @association = Association.find(params[:id])
---
SELECT "associations".* FROM "associations" WHERE "associations"."id" = 1 LIMIT 1

  def create
    @association = Association.new(params[:association])
    if @association.save
---
INSERT INTO "associations" ("RFID", "URI", "created_at", "updated_at") VALUES ('test ', 'test', '2011-11-05 20:31:34.618051', '2011-11-05 20:31:34.618051')

  def edit
    @association = Association.find(params[:id])
---
SELECT "associations".* FROM "associations" WHERE "associations"."id" = 1 LIMIT 1

  def update
    @association = Association.find(params[:id])
    if @association.update_attributes(params[:association])
---
SELECT "associations".* FROM "associations" WHERE "associations"."id" = 1 LIMIT 1
UPDATE "associations" SET "RFID" = 'test2', "updated_at" = '2011-11-06 00:13:02.331934' WHERE "associations"."id" = 1