app/controllers/boxes_controller.rb

  def index
    @boxes = Box.all
---
SELECT "boxes".* FROM "boxes"

  def show
    @box = Box.find(params[:id])
---
SELECT "boxes".* FROM "boxes" WHERE "boxes"."id" = 1 LIMIT 1

  def create
    @box = Box.new(params[:box])
    if @box.save
---
INSERT INTO "boxes" ("lastRFID", "lastEmptyRFID", "created_at", "updated_at") VALUES ('test', 'test', '2011-11-06 00:13:58.495771', '2011-11-06 00:13:58.495771')